#include<iostream>  
#include <opencv2/core/core.hpp>  
#include <opencv2/highgui/highgui.hpp>  
 
using namespace cv;  
//using namespace std;

int main()  
{  
	//// 读入一张图片（游戏原画）  
	//Mat img=imread("Penguins.jpg");  
	//// 创建一个名为 "游戏原画"窗口  
	//cvNamedWindow("游戏原画");  
	//// 在窗口中显示游戏原画  
	//imshow("游戏原画",img);  
	//// 等待6000 ms后窗口自动关闭  
	//waitKey(6000);  

	//-----------------------------------【程序说明】----------------------------------------------  
	//  程序名称:：【OpenCV入门教程之三】图像的载入，显示与输出 一站式完全解析 博文配套源码  
	// VS2010版   OpenCV版本：2.4.8  
	//      2014年3月5日 Create by 浅墨  
	//  描述： 图像的载入，显示与输出 一站式剖析   配套源码  
	//  图片素材出处：dota2原画圣堂刺客 dota2 logo  动漫人物  
	//------------------------------------------------------------------------------------------------  
		//-----------------------------------【一、图像的载入和显示】--------------------------------------  
		//     描述：以下三行代码用于完成图像的载入和显示  
		//--------------------------------------------------------------------------------------------------  

		Mat girl=imread("Penguins.jpg"); //载入图像到Mat  
		namedWindow("【1】动漫图"); //创建一个名为 "【1】动漫图"的窗口   
		imshow("【1】动漫图",girl);//显示名为 "【1】动漫图"的窗口   

		//-----------------------------------【二、初级图像混合】--------------------------------------  
		//     描述：二、初级图像混合  
		//-----------------------------------------------------------------------------------------------  
		////载入图片  
		Mat image= imread("Koala.jpg",199);  
		Mat logo= imread("logo.jpg");  

		////载入后先显示  
		namedWindow("【2】原画图");  
		imshow("【2】原画图",image);  

		namedWindow("【3】logo图");  
		imshow("【3】logo图",logo);  

		////定义一个Mat类型，用于存放，图像的ROI  
		Mat imageROI;  
		////方法一  
		imageROI=image(Rect(400,300,logo.cols,logo.rows));  
		////方法二  
		//imageROI=image(Range(200,200+logo.rows),Range(200,300+logo.cols));  

		////将logo加到原图上  
		addWeighted(imageROI,0.5,logo,0.3,0.2,imageROI);  

		////显示结果  
		namedWindow("【4】原画+logo图");  
		imshow("【4】原画+logo图",image);  

		//-----------------------------------【三、图像的输出】--------------------------------------  
		//     描述：将一个Mat图像输出到图像文件  
		//-----------------------------------------------------------------------------------------------  
		//输出一张jpg图片到工程目录下  
		imwrite("Hydrangeas.jpg",image);  

		waitKey(3000);  

		return 0;  
	
}  